#language: ru



Функционал: создание документа ПТиУ

Как Менеджер по закупкам я хочу
создание ПТиУ 
чтобы поставить товар на учет   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: создаем ПТиУ
// Создание документа
* Открытие формы
	И я закрываю все окна клиентского приложения
	И В командном интерфейсе я выбираю "Закупки" "Поступления товаров"
	Тогда открылось окно "Поступления товаров"
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно "Поступление товара (создание)"
* Заполнение шапки
	И из выпадающего списка с именем 'Организация' я выбираю точное значение "ООО \"Товары\""
	И из выпадающего списка с именем 'Склад' я выбираю точное значение "Склад отдела продаж"
	// Обязательно проверяем заполнение
	Тогда элемент формы с именем 'Склад' стал равен "Склад отдела продаж"
	И из выпадающего списка с именем 'Валюта' я выбираю точное значение "USD"
	И из выпадающего списка с именем 'Поставщик' я выбираю точное значение "Магазин \"Бытовая техника\""
* Заполнение ТЧ
	И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице 'Товары' из выпадающего списка с именем 'ТоварыТовар' я выбираю по строке "2"
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
	И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "10,00"
	И в таблице 'Товары' я завершаю редактирование строки
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
* Проверка заполнения ТЧ
	Тогда таблица 'Товары' стала равной:
		| 'N' | 'Товар'     | 'Артикул' | 'Цена'     | 'Количество' | 'Сумма' |
		| '1' | 'Bosch1234' | 'Ч-0001'  | '2 500,00' | '101,00'      | '252 000,00'  |			
* Номер
	И я запоминаю значение поля "Номер" как "$Номер$" // Назваеие локальной переменной, которую можно юзать в дальнейшем
* Провели
	И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
	И я жду закрытия окна "Поступление товара (создание) *" в течение 20 секунд
* Проверка создания
// Обязательно проверяем заполнение
	И таблица "Список" содержит строки :
		| 'Номер' |
		| '$Номер$'   |
	

Сценарий: Проверка наличия справ номенклатуры Торт
	И В командном интерфейсе я выбираю "Продажи" "Товары"
	И таблица "Список" содержит строки :
		| 'Наименование' |
		| 'Торт'   |
